In [14]:
import numpy as np
import pandas as pd

In [15]:
#Series

In [16]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d ={'a':10,'b':20,'c':100}

In [17]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [18]:
pd.Series(d)

a     10
b     20
c    100
dtype: int64

In [19]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [20]:
ser1 = pd.Series([1,2,3,4], index=['USA','CHINA','GERMANY','FRANCE'])

In [21]:
ser1

USA        1
CHINA      2
GERMANY    3
FRANCE     4
dtype: int64

In [22]:
ser2 = pd.Series([1,2,3,4], index=['USA','CHINA','JAPAN','ITALY'])

In [23]:
ser2

USA      1
CHINA    2
JAPAN    3
ITALY    4
dtype: int64

In [24]:
ser1['USA']

1

In [25]:
ser2[0]

1

In [26]:
ser1 + ser2

CHINA      4.0
FRANCE     NaN
GERMANY    NaN
ITALY      NaN
JAPAN      NaN
USA        2.0
dtype: float64

In [27]:
#dataFrames

In [28]:
from numpy.random import randn

In [29]:
np.random.seed(101)

In [30]:
#creating a dataframe
df132424 = pd.DataFrame({
    'name': ['John', 'Jane', 'Jim'],
    'product': ['shoe', 'basketball', 'shorts'],
    'age': [12, 35, 43]    
})
print(df132424)
print('        -----         ')
df132425 = pd.DataFrame([
    ['john', 'shoe', 12],
    ['jane', 'basketball', 35]
],
    columns=[
        'name', 'product', 'age'
    ]
)
print(df132425)

   name     product  age
0  John        shoe   12
1  Jane  basketball   35
2   Jim      shorts   43
        -----
   name     product  age
0  john        shoe   12
1  jane  basketball   35

In [31]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [34]:
df['new'] = df['W']+df['X']

In [35]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [36]:
df.drop('Y',axis=1,inplace=True)

In [37]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.334983
B  0.651118 -0.319318  0.605965  0.331800
C -2.018168  0.740122 -0.589001 -1.278046
D  0.188695 -0.758872  0.955057 -0.570177
E  0.190794  1.978757  0.683509  2.169552

In [38]:
df.drop('E') #dont need axis

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.334983
B  0.651118 -0.319318  0.605965  0.331800
C -2.018168  0.740122 -0.589001 -1.278046
D  0.188695 -0.758872  0.955057 -0.570177

In [39]:
df.shape

(5, 4)

In [40]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.334983
B  0.651118 -0.319318  0.605965  0.331800
C -2.018168  0.740122 -0.589001 -1.278046
D  0.188695 -0.758872  0.955057 -0.570177
E  0.190794  1.978757  0.683509  2.169552

In [41]:
#selecting rows
df.loc['A']

W      2.706850
X      0.628133
Z      0.503826
new    3.334983
Name: A, dtype: float64

In [42]:
df.iloc[0]

W      2.706850
X      0.628133
Z      0.503826
new    3.334983
Name: A, dtype: float64

In [53]:
df.loc['B','Z']

0.6059653494949336

In [43]:
df.loc[['A','B'],['W','X','Z']]

          W         X         Z
A  2.706850  0.628133  0.503826
B  0.651118 -0.319318  0.605965

In [44]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.334983
B  0.651118 -0.319318  0.605965  0.331800
C -2.018168  0.740122 -0.589001 -1.278046
D  0.188695 -0.758872  0.955057 -0.570177
E  0.190794  1.978757  0.683509  2.169552

In [45]:
booldf = df > 0

In [46]:
df[booldf]

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.334983
B  0.651118       NaN  0.605965  0.331800
C       NaN  0.740122       NaN       NaN
D  0.188695       NaN  0.955057       NaN
E  0.190794  1.978757  0.683509  2.169552

In [47]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [48]:
resultdf = df[df['W']<0]

In [49]:
resultdf

          W         X         Z       new
C -2.018168  0.740122 -0.589001 -1.278046

In [50]:
resultdf['X']

C    0.740122
Name: X, dtype: float64

In [51]:
df[df['W']<0]['X']

C    0.740122
Name: X, dtype: float64

In [52]:
df[df['W']<0]

          W         X         Z       new
C -2.018168  0.740122 -0.589001 -1.278046

In [53]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.334983
B  0.651118 -0.319318  0.605965  0.331800
C -2.018168  0.740122 -0.589001 -1.278046
D  0.188695 -0.758872  0.955057 -0.570177
E  0.190794  1.978757  0.683509  2.169552

In [54]:
df[(df['W']>0) & (df['X']>0)]

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.334983
E  0.190794  1.978757  0.683509  2.169552

In [55]:
df.reset_index()

  index         W         X         Z       new
0     A  2.706850  0.628133  0.503826  3.334983
1     B  0.651118 -0.319318  0.605965  0.331800
2     C -2.018168  0.740122 -0.589001 -1.278046
3     D  0.188695 -0.758872  0.955057 -0.570177
4     E  0.190794  1.978757  0.683509  2.169552

In [56]:
newind = 'CA NY WY OR CO'.split()

In [57]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [58]:
df['States'] = newind

In [59]:
df

          W         X         Z       new States
A  2.706850  0.628133  0.503826  3.334983     CA
B  0.651118 -0.319318  0.605965  0.331800     NY
C -2.018168  0.740122 -0.589001 -1.278046     WY
D  0.188695 -0.758872  0.955057 -0.570177     OR
E  0.190794  1.978757  0.683509  2.169552     CO

In [60]:
df.set_index('States')

               W         X         Z       new
States
CA      2.706850  0.628133  0.503826  3.334983
NY      0.651118 -0.319318  0.605965  0.331800
WY     -2.018168  0.740122 -0.589001 -1.278046
OR      0.188695 -0.758872  0.955057 -0.570177
CO      0.190794  1.978757  0.683509  2.169552

In [61]:
df

          W         X         Z       new States
A  2.706850  0.628133  0.503826  3.334983     CA
B  0.651118 -0.319318  0.605965  0.331800     NY
C -2.018168  0.740122 -0.589001 -1.278046     WY
D  0.188695 -0.758872  0.955057 -0.570177     OR
E  0.190794  1.978757  0.683509  2.169552     CO

In [62]:
#index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [64]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [65]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [66]:
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [67]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [68]:
df.index.names

FrozenList([None, None])

In [69]:
df.index.names = ['Groups', 'Nums']

In [70]:
df

                    A         B
Groups Nums
G1     1    -0.497104 -0.754070
       2    -0.943406  0.484752
       3    -0.116773  1.901755
G2     1     0.238127  1.996652
       2    -0.993263  0.196800
       3    -1.136645  0.000366

In [71]:
df.loc['G2'].loc[2]['B']

0.19679950499134005

In [72]:
df.loc['G1'].loc[2]['A']

-0.9434064032519315

In [73]:
df.xs(1, level='Nums')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [74]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [75]:
df = pd.DataFrame(d)

In [77]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [79]:
#drop non available
df.dropna()

     A    B  C
0  1.0  5.0  1

In [165]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [80]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [170]:
df.fillna(value='Filled')

        A       B  C
0       1       5  1
1       2  Filled  2
2  Filled  Filled  3

In [172]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64